window.resumeRawData = {
    填写该简历之年月: '2025 年 8 月',
    个人信息摘要: {
        姓名: '吴乐川',
        姓名拼音: [ undefined, 'lè', undefined ],
        职业称谓: '资深网页开发工程师',
        联系方式: {
            手机号: '180-1787-0319',
            微信号: '180-1787-0319',
            电子邮箱: 'wulechuan@live.com',
            代码仓库: 'https://gitee.com/nanchang-wulechuan',
        },
        个人简介: [
            '我是一名拥有十三年经验的前端开发工程师。',
            '我对技术充满热情，具备从需求分析到项目部署的全栈能力，并善于团队协作与沟通，追求极致的用户体验和代码质量。',
        ],
    },
    受教育经历: [
        {
            教育机构: '南京邮电大学',
            主修专业: '通信工程',
            时间段: [
                [ 1996, 9 ],
                [ 2000, 7 ],
            ],
        },
    ],
    技能集: {
        开发语言: [
            'JavaScript (ES5)',
            'JavaScript (ES6 ~ ES2025)',
            'TypeScript',
            'HTML5',
            'CSS3',
            'Sass',
            'Less',
            'Stylus',
        ],
        开发框架: [
            'Vuejs (2/3)',
            'Vuex (old)',
            'Pinia',
            'Vue Router',
            'Nuxt.js',
            'React',
            'Node.js',
            'Express.js',
            'Element Plus',
            'Ant Design Vue',
        ],
        开发工具: [
            'Vite',
            'Webpack',
            'git',
            'npm',
            'Docker',
            'Figma',
            'ECharts',
        ],
    },
    从业经历: [
        {
            企业名称: '辛米尔视觉科技（上海）有限公司',
            职位名称: '高级前端开发工程师',
            时间段: [
                [2021, 7],
            ],
            岗位职责: [
                '待详',
            ],
        },
        {
            企业名称: '申铁信息技术',
            职位名称: '高级前端开发工程师',
            时间段: [
                [ 2018, 6 ],
                [ 2022, 6 ],
            ],
            岗位职责: [
                '待详',
            ],
        },
    ],
    项目经验: [
        {
            项目名称: '辛米尔智能相机自管系统界面',
            时间段: [
                [2022, 10 ],
                [2025,  8 ],
            ],
            项目简述: [
                '待详',
            ],
            所用技术栈: [
                'Vuejs 3',
                'TypeScript',
                'Pinia',
                'ECharts',
                'Element Plus',
                'Vite',
            ],
            项目成果地址: '',
        },
        {
            项目名称: '铁路 PHM',
            时间段: [
                [ 2018, 6 ],
                [ 2022, 6 ],
            ],
            项目简述: [
                '待详',
            ],
            所用技术栈: [
                'Vuejs 2',
                'ECharts',
                'Element Plus',
            ],
            项目成果地址: '',
        },
    ],
};
